#include <stdio.h>

int main() {
  float a, b, c;
  //Введення даних
  printf("\nВведіть довжину першої сторони трикутника: ");
  scanf("%f", &a);
  printf("Введіть довжину другої сторони трикутника: ");
  scanf("%f", &b);
  printf("Введіть довжину третьої сторони трикутника: ");
  scanf("%f", &c);

  // Обчислення
  if (a+b <= c || b+c <= a || a+c <= b) {
    printf("\nТрикутник неможливо утворити (одна з сторін більша або довірнює сумі двох інших)");
  }
  else {
    if (a == b && b == c) {
      printf("\nТрикутник рівносторонній\n");
    }
    else if (a != b && b != c && a != c) {
      printf("\nТрикутник різносторонній\n");
    }
    else {
      printf("\nТрикутник рівнобедрений\n");
    }
  }
  return 0;
}
