#include <stdio.h>
#include <math.h>


int main() {
  float x, f;
  int n;

  //Вибір методу
  printf("--------------------------------\n");
  printf("Як ви хочите виконати програму?\n");
  printf("--------------------------------\n\n");
  printf("За допомогою скороченої форми оператора розгалуження (if) - 1\n");
  printf("За допомогою повної форми оператора розгалуження (if, else, else if) - 2\n");
  printf("Вийти з програми - 3\n");
  printf("--------------------------------\n\n");

  printf("Ввести: ");
  scanf("%d", &n);

  //З використанням if
  if (n == 1) {
    //Введення даних
    printf("\nВведіть дійсне число x: ");
    scanf("%f", &x);
    //Обчислення
    if (x <= 2) {
      f = pow(x, 2) + 5*x - 6;
      printf("Відповідь: f(x) = %.2f", f);
    }
    if (x > 2) {
      f = fabs(x + cos(x)); // fabs - модуль числа
      printf("Відповідь: f(x) = %.2f", f);
    }

  }
  //З використаннм if, else if, else
  else if (n == 2) {
    //Введення даних
    printf("\nВведіть дійсне число x: ");
    scanf("%f", &x);
    //Обчислення
    if (x <= 2) {
      f = pow(x, 2) + 5*x - 6;
      printf("Відповідь: f(x) = %.2f", f);
    }
    else {
      f = fabs(x + cos(x)); // fabs - модуль числа
      printf("Відповідь: f(x) = %.2f", f);
    }
  }
  else {
    printf("\nРоботу програми завершено!\n");
  }

  return 0;
}
